app/controllers/posts_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
INSERT INTO `replies` (`name`, `created_at`, `body`, `updated_at`, `post_id`) VALUES('Joe', '2009-04-09 13:09:57', 'Hi there!', '2009-04-09 13:09:57', 1)
---
	def reply
		@reply = Reply.new(params[:reply])
		@post = Post.find params[:reply][:post_id]
		flash[:notice] = 'Successfully Replied' if @reply.save

INSERT INTO `posts` (`name`, `created_at`, `title`, `body`, `updated_at`) VALUES('Ralph', '2009-04-09 12:29:35', 'Greetings', 'Lorem Ipsum', '2009-04-09 12:29:35')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `updated_at` = '2009-04-09 14:40:43', `body` = 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.' WHERE `id` = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])